# Пользователь вводит Имя, Возраст и Город, сформировать
# приветственное сообщение путем форматирования 3-мя способами


# name = input('Привет, как тебя зовут?\n')
# age = input('Сколько тебе лет?\n')
# city = input('С какого ты города?\n')


print('Привет, как тебя зовут?')
myName = input()
print('Сколько тебе лет?')
myAge = input()
print('C какого ты города?')
myCity = input()
print('Что ты любишь?')
myCity = input()
print('Ты очень красивая')
myCity = input()



